{
    "topic":{
        "id":491,
        "title":"Some people enjoy hightech jobs,such as those in use of computer a lot,while others prefer jobs with no requirement of hightech skills.Which do you prefer and why?",
        "level":3,
        "isTrending":0,
        "Tags":[
                {
                "id":4,
                "title":"job",
                "TopicTag":{
                "id":491,
                "tagId":4,
                "topicId":491,
                "createdAt":null,
                "updatedAt":null
                }
                },
                {
                "id":2,
                "title":"culture",
                "TopicTag":{
                "id":492,
                "tagId":2,
                "topicId":491,
                "createdAt":null,
                "updatedAt":null
                }
                }
                ],
        "Answers":[
                   {
                   "id":491,
                   "title":"Some people prefer jobs with no requirement of hightech skills. However, I enjoy hightech jobs such as those in use of computer a lot. \nFirst, walking into almost any business, you'll quickly see how hightech has transformed the way we work. Whether you're an entrepreneur, a bike courier, or a criminal lawyer, one thing is clear: our lives are surrounded by hightech. There's no escape and the hightech makes our jobs more convenient. So just enjoy it. \nSecond, hightech has made us more responsive, more able to gain access to information over a broader spectrum, and more effective to deal with our work. For example, it has taken our information and, instead of putting it into little cubbyholes of the company, made it broadly accessible. It makes that information much more functional and dynamic.",
                   "references":"[{\"link\":\"http:\u002F\u002Fwww.inc.com\u002Fmagazine\u002F19940615\u002F3275.html\"}]",
                   "audio_url":"http:\u002F\u002Ftftsandbox.oss-cn-shanghai.aliyuncs.com\u002Fpolly_speeches\u002Fanswer-491.mp3",
                   "updatedAt":"2017-07-22T05:42:05.000Z",
                   "User":{
                   "id":1,
                   "username":"TFT",
                   "user_role":""
                   },
                   "Likes":[
                            {
                            "id":1154,
                            "AnswerId":491,
                            "UserId":1004
                            },
                            {
                            "id":1216,
                            "AnswerId":491,
                            "UserId":1006
                            },
                            {
                            "id":1291,
                            "AnswerId":491,
                            "UserId":1129
                            },
                            {
                            "id":1292,
                            "AnswerId":491,
                            "UserId":1129
                            },
                            {
                            "id":1296,
                            "AnswerId":491,
                            "UserId":1136
                            },
                            {
                            "id":1297,
                            "AnswerId":491,
                            "UserId":1136
                            },
                            {
                            "id":1319,
                            "AnswerId":491,
                            "UserId":1142
                            },
                            {
                            "id":1326,
                            "AnswerId":491,
                            "UserId":1056
                            },
                            {
                            "id":1334,
                            "AnswerId":491,
                            "UserId":1046
                            },
                            {
                            "id":1359,
                            "AnswerId":491,
                            "UserId":1155
                            },
                            {
                            "id":1363,
                            "AnswerId":491,
                            "UserId":1173
                            },
                            {
                            "id":1384,
                            "AnswerId":491,
                            "UserId":1219
                            },
                            {
                            "id":1427,
                            "AnswerId":491,
                            "UserId":1018
                            },
                            {
                            "id":1483,
                            "AnswerId":491,
                            "UserId":1272
                            },
                            {
                            "id":1505,
                            "AnswerId":491,
                            "UserId":1164
                            },
                            {
                            "id":1510,
                            "AnswerId":491,
                            "UserId":1279
                            },
                            {
                            "id":1654,
                            "AnswerId":491,
                            "UserId":1130
                            },
                            {
                            "id":1660,
                            "AnswerId":491,
                            "UserId":1385
                            },
                            {
                            "id":1666,
                            "AnswerId":491,
                            "UserId":1209
                            },
                            {
                            "id":1671,
                            "AnswerId":491,
                            "UserId":1035
                            },
                            {
                            "id":1684,
                            "AnswerId":491,
                            "UserId":1373
                            },
                            {
                            "id":1700,
                            "AnswerId":491,
                            "UserId":1428
                            }
                            ],
                   "Comments":[
                               {
                               "id":1212,
                               "title":"re convenient. So just enjoy it. Second, hightech has made us more responsive, more able to gain access to information over a broader spectrum, and more effective to deal with our work. For example, it has taken",
                               "createdAt":"2017-07-09T21:49:16.000Z",
                               "User":{
                               "id":1001,
                               "username":"ZeeQ"
                               }
                               },
                               {
                               "id":1225,
                               "title":"cubbyhole: ",
                               "createdAt":"2017-07-10T10:46:24.000Z",
                               "User":{
                               "id":1142,
                               "username":"Kyle"
                               }
                               },
                               {
                               "id":1247,
                               "title":"I like the expression \"more able to gain access to information over a broader spectrum\". The word \"spectrum\" is vivid.",
                               "createdAt":"2017-07-10T15:51:59.000Z",
                               "User":{
                               "id":1142,
                               "username":"Kyle"
                               }
                               },
                               {
                               "id":1298,
                               "title":"First, we are surrounded by  hightech , just accept it; second, hightech makes us more responsive.  I like this sentence :  hightech has made us more responsive, more able to gain access to information over a broader spectrum, and more effective to deal with our work.",
                               "createdAt":"2017-07-12T14:46:54.000Z",
                               "User":{
                               "id":1155,
                               "username":"bestmzy"
                               }
                               },
                               {
                               "id":1328,
                               "title":"框架：1 our lives are surrounded by hightech 2 hightech has made us more responsive, more able to gain access to information over a broader spectrum, and more effective to deal with our work",
                               "createdAt":"2017-07-15T09:05:40.000Z",
                               "User":{
                               "id":1162,
                               "username":"yIN"
                               }
                               },
                               {
                               "id":1369,
                               "title":"论点1.our lives are surrounded by hightech. 2. hightech makes our life more responsive.  表达: there is no escape   gain access to information   broadly accessible",
                               "createdAt":"2017-07-18T05:27:09.000Z",
                               "User":{
                               "id":1320,
                               "username":"wukelun"
                               }
                               },
                               {
                               "id":1389,
                               "title":"expressions:walking into almost any business, there's no escape, gain access to information over a broader spectrum.",
                               "createdAt":"2017-07-18T14:17:58.000Z",
                               "User":{
                               "id":1333,
                               "username":"The_Catcher"
                               }
                               },
                               {
                               "id":1405,
                               "title":"those in use of computer a lot; one thing is clear; There's no escape; over a broader spectrum; cubbyhole",
                               "createdAt":"2017-07-19T08:27:22.000Z",
                               "User":{
                               "id":1220,
                               "username":"FlashPilot"
                               }
                               },
                               {
                               "id":1409,
                               "title":" entrepreneur[ɑ:ntrəprəˈnɜ:(r)]企业家 courier[ˈkʊriɚ]导游  spectrum[ˈspɛktrəm]范围 cubbyhole[ˈkʌbihoʊl]文件夹",
                               "createdAt":"2017-07-20T02:04:43.000Z",
                               "User":{
                               "id":1345,
                               "username":"Sharon"
                               }
                               },
                               {
                               "id":1410,
                               "title":"lives[laɪvz] 生命，生活 life的复数",
                               "createdAt":"2017-07-20T02:09:13.000Z",
                               "User":{
                               "id":1345,
                               "username":"Sharon"
                               }
                               },
                               {
                               "id":1445,
                               "title":"1. hightech has transformed the way we work  2.hightech has made us more responsive and more efficient",
                               "createdAt":"2017-07-27T04:42:19.000Z",
                               "User":{
                               "id":1209,
                               "username":"gai"
                               }
                               },
                               {
                               "id":1448,
                               "title":"1. Our lives are surrounded by Hightech. 2. Benefits ",
                               "createdAt":"2017-07-27T15:03:34.000Z",
                               "User":{
                               "id":1373,
                               "username":"竹取"
                               }
                               },
                               {
                               "id":1449,
                               "title":"Great Expression: For example, it has taken our information and, instead of putting it into little cubbyholes of the company, made it broadly accessible. It makes that information much more functional and dynamic.",
                               "createdAt":"2017-07-27T15:05:27.000Z",
                               "User":{
                               "id":1373,
                               "username":"竹取"
                               }
                               },
                               {
                               "id":1460,
                               "title":"1.there's no escape... 2.over a broad spectrum",
                               "createdAt":"2017-07-29T15:12:13.000Z",
                               "User":{
                               "id":1428,
                               "username":"jojoliu"
                               }
                               }
                               ]
                   },
                   {
                   "id":718,
                   "title":"   I prefer high tech jobs. First, actually my major is computer science, so doing a high tech job can make full use of my major knowledge and if I do the job that with no requirement of high tech skills, I may be not as well as others who majored in other majors. \n   Second, jobs in the high tech industry have a strong potential for growth, as you can see, everyone is using high tech product nowadays, in fact The high tech sector has become a major source of economic growth fueling the economy, the future is just brighter doing a high tech job than doing a job that not related to high tech skills.\n   These are the reasons why I chose to take a high tech job.",
                   "references":"[{\"content\":\"DIVERSITY IN HIGH TECH\",\"link\":\"https:\u002F\u002Fwww.eeoc.gov\u002Feeoc\u002Fstatistics\u002Freports\u002Fhightech\u002F\"}]",
                   "audio_url":"http:\u002F\u002Ftftsandbox.oss-cn-shanghai.aliyuncs.com\u002Fpolly_speeches\u002Fanswer-718.mp3",
                   "updatedAt":"2017-07-13T15:07:44.000Z",
                   "User":{
                   "id":1153,
                   "username":"wyb",
                   "user_role":"guest"
                   },
                   "Likes":[
                   
                   ],
                   "Comments":[
                   
                   ]
                   },
                   {
                   "id":790,
                   "title":"I prefer jobs with no requirement of hightech skills.\n\nFirst, the more advanced society becomes technologically, the more people begin to depend on computers and other forms of technology for everyday existence. This means that when a machine breaks or a computer crashes, humans become almost disabled until the problem is resolved. This kind of dependency on technology puts people at a distinct disadvantage, because they become less self-reliant.\n\nAnother disadvantage of high technology is that human workers retain less value. Because machines automate processes and do the work of 10 people with one computer, companies find they don't need to employ as many people to get the job done. As machines and computers become even more advanced and efficient, this will continue to be a growing disadvantage of technology and an issue that has a global impact.",
                   "references":"[{\"content\":\"Advantages and Disadvantages of Technology Advances\",\"link\":\"http:\u002F\u002Fsmallbusiness.chron.com\u002Fadvantages-disadvantages-technology-advances-12579.html\"}]",
                   "audio_url":null,
                   "updatedAt":"2017-07-19T12:34:51.000Z",
                   "User":{
                   "id":1099,
                   "username":"Ocean",
                   "user_role":"guest"
                   },
                   "Likes":[
                            {
                            "id":1690,
                            "AnswerId":790,
                            "UserId":1405
                            }
                            ],
                   "Comments":[
                               {
                               "id":1451,
                               "title":"Structure: opinions= point1+example1  point2+example2 Great Expression:  a growing disadvantage; a global impact;puts people at a distinct disadvantage",
                               "createdAt":"2017-07-27T15:50:55.000Z",
                               "User":{
                               "id":1405,
                               "username":"Quan"
                               }
                               }
                               ]
                   },
                   {
                   "id":891,
                   "title":"I prefer to work in high-tech jobs. First, technology advances show people a more efficient way to do things, and these processes get results. For example, education has been greatly advanced by the technological advances of computers. Students are able to learn on a global scale without ever leaving their classrooms. Agricultural processes that once required dozens upon dozens of human workers can now be automated, thanks to advances in technology, which means cost-efficiency for farmers. Medical discoveries occur at a much more rapid rate, thanks to machines and computers that aid in the research process and allow for more intense educational research into medical matters. Second, cost efficiency is an advantage in some ways and a disadvantage in others. As technology improves on existing processes and showcases new ways to accomplish tasks, machines are able to produce the same -- if not more -- output than humans in certain industries. This results in cost savings for business owners, allowing them to invest in growth in other areas of the business, which contributes on a positive level to the economy as a whole.",
                   "references":"[{\"content\":\"http:\u002F\u002Fsmallbusiness.chron.com\u002Fadvantages-disadvantages-technology-advances-12579.html\",\"link\":\"\"}]",
                   "audio_url":null,
                   "updatedAt":"2017-07-31T11:37:52.000Z",
                   "User":{
                   "id":1094,
                   "username":"Chrystal",
                   "user_role":"guest"
                   },
                   "Likes":[
                   
                   ],
                   "Comments":[
                   
                   ]
                   }
                   ]
    }
}
